# Create a csv for movie_link table

In [3]:
# Below ended up not being used. We decided against a seperate links table and this data is included in the movies table

In [4]:
import pandas as pd
import numpy as np

In [5]:
df = pd.read_csv('raw_data/links.csv', index_col = 0)

In [6]:
df

           imdbId     tmdbId
movieId
1          114709      862.0
2          113497     8844.0
3          113228    15602.0
4          114885    31357.0
5          113041    11862.0
...           ...        ...
288967   14418234   845861.0
288971   11162178   878958.0
288975      70199   150392.0
288977   23050520  1102551.0
288983   11644948   940588.0

[86537 rows x 2 columns]

In [7]:
df.isnull().sum()

imdbId      0
tmdbId    126
dtype: int64

In [8]:
# fillna(0) not working as expected, it created another column
df['tmdbId'] = df['tmdbId'].replace(np.nan, 0)

In [10]:
df

           imdbId     tmdbId
movieId
1          114709      862.0
2          113497     8844.0
3          113228    15602.0
4          114885    31357.0
5          113041    11862.0
...           ...        ...
288967   14418234   845861.0
288971   11162178   878958.0
288975      70199   150392.0
288977   23050520  1102551.0
288983   11644948   940588.0

[86537 rows x 2 columns]

In [11]:
df.isnull().sum()

imdbId    0
tmdbId    0
dtype: int64

In [35]:
# Uncomment if needed to write the csv
#df.to_csv('DB_models/DB_links.csv')